uhnp/src/DataProcessors/РеестрУведомленийОбИностранныхКомпаниях/РеестрУведомленийОбИностранныхКомпаниях.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РеестрУведомленийОбИностранныхКомпаниях</name>
</mdclass:DataProcessor>

uhnp/src/InformationRegisters/ДокументыФизическихЛиц/ДокументыФизическихЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДокументыФизическихЛиц</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КемВыдан</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодПодразделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЯвляетсяДокументомУдостоверяющимЛичность</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовФизическихЛиц</types>
    </type>
  </resources>
  <resources>
    <name>ФамилияЛатиницей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяЛатиницей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтранаВыдачи</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </resources>
  <resources>
    <name>КатегорииТранспортныхСредств</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Физлицо</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>CatalogRef.ВидыДокументовФизическихЛиц</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/DataProcessors/РеестрУведомленийОбИностранныхКомпаниях/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Год = Год(ТекущаяДата());
	МодельНеЗаполнена = Ложь;
	РегламентированнаяОтчетностьКИК.ПроверитьЗаполненностьМодели(МодельНеЗаполнена);
	Элементы.ГруппаПредупреждение.Видимость = МодельНеЗаполнена;
	Сценарий = Константы.СценарийОтчетностиКИК.Получить();
	Инвестор = Параметры.Инвестор;
	ДатаРеестра = ТекущаяДата();
	ОбновитьНаСервере();
	УстановкаОтборов(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Запись_УведомлениеОСпецрежимахНалогообложения" Тогда
		РеестрОсновнойПриАктивизацииСтроки(Неопределено);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ДатаРеестраПриИзменении(Элемент)
	ОбновитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыРеестрОсновной

&НаКлиенте
Процедура РеестрОсновнойПриАктивизацииСтроки(Элемент)
	Если Элементы.РеестрОсновной.ТекущиеДанные = Неопределено Тогда
		УстановкаОтборов(Неопределено);
	Иначе
		УстановкаОтборов(Элементы.РеестрОсновной.ТекущиеДанные.Инвестор);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановкаОтборов(Инвестор)
	Если Инвестор <> Неопределено Тогда
		УведомленияОбУчастии.Параметры.УстановитьЗначениеПараметра("Инвестор", Инвестор);
	Иначе
		УведомленияОбУчастии.Параметры.УстановитьЗначениеПараметра("Инвестор", Справочники.Организации.ПустаяСсылка());
	КонецЕсли;
	УведомленияОбУчастии.Параметры.УстановитьЗначениеПараметра("Период", КонецДня(ДатаРеестра));
	УведомленияОбУчастии.Параметры.УстановитьЗначениеПараметра("Сценарий", Сценарий);
	
	Если Инвестор <> Неопределено Тогда
		УведомленияОКИК.Параметры.УстановитьЗначениеПараметра("Инвестор", Инвестор);
	Иначе
		УведомленияОКИК.Параметры.УстановитьЗначениеПараметра("Инвестор", Справочники.Организации.ПустаяСсылка());
	КонецЕсли;
	УведомленияОКИК.Параметры.УстановитьЗначениеПараметра("Год", КонецГода(Дата(Год, 1, 1)));
	УведомленияОКИК.Параметры.УстановитьЗначениеПараметра("Сценарий", Сценарий);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УведомлениеОСпецрежимахНалогообложения.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.УведомлениеОСпецрежимахНалогообложения КАК УведомлениеОСпецрежимахНалогообложения
		|ГДЕ
		|	УведомлениеОСпецрежимахНалогообложения.Организация = &Инвестор
		|	И УведомлениеОСпецрежимахНалогообложения.ВидУведомления = ЗНАЧЕНИЕ(Перечисление.ВидыУведомленийОСпецрежимахНалогообложения.ФормаКИК)
		|	И УведомлениеОСпецрежимахНалогообложения.ПометкаУдаления = ЛОЖЬ
		|	И УведомлениеОСпецрежимахНалогообложения.НалоговыйПериод = ГОД(&Год)";
	
	Запрос.УстановитьПараметр("Год", КонецГода(Дата(Год, 1, 1)));
	Запрос.УстановитьПараметр("Инвестор", Инвестор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	УведомленияОКИКДляИнвестора.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
	Если УведомленияОКИКДляИнвестора.Количество() = 0 Тогда
		Элементы.УведомленияОКИКСоздатьОткрытьУведомлениеОКИК.Картинка = БиблиотекаКартинок.СоздатьЭлементСписка;
		Элементы.УведомленияОКИКСоздатьОткрытьУведомлениеОКИК.Заголовок = НСтр("ru = 'Создать уведомление о КИК'");
	Иначе
		Элементы.УведомленияОКИКСоздатьОткрытьУведомлениеОКИК.Картинка = БиблиотекаКартинок.ЛупаУХ;
		Элементы.УведомленияОКИКСоздатьОткрытьУведомлениеОКИК.Заголовок = НСтр("ru = 'Открыть уведомление о КИК'");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьРеестр(Команда)
	ОбновитьНаСервере();
	РеестрОсновнойПриАктивизацииСтроки(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьМодель(Команда)
	Элементы.ГруппаПредупреждение.Видимость = Ложь;
	ОткрытьФорму("Обработка.ГенерацияМоделиОтчетностиКИК.Форма", Новый Структура("Сценарий, ДатаРеестра", Сценарий, ДатаРеестра));
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьДатуАктуальности()
	Текст = "";
	Если РасчетДолейВладения.ПоследовательностьАктуальна(ДатаРеестра, Текст) = Ложь Тогда
		Элементы.НадписьАктуальность.Заголовок = Текст;
		Элементы.ГруппаАктуальность.Видимость = Истина;
	Иначе 
		Элементы.ГруппаАктуальность.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()
	
	ПроверитьДатуАктуальности();
	РеестрОсновной.Параметры.УстановитьЗначениеПараметра("ДатаСреза", КонецДня(ДатаРеестра));
	РеестрОсновной.Параметры.УстановитьЗначениеПараметра("Сценарий", Сценарий);
	Элементы.РеестрОсновной.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьУведомление(Команда)
	Если ТипЗнч(Элементы.УведомленияОбУчастии.ТекущиеДанные.Документ) <> Тип("Строка") Тогда
		ПоказатьВопрос(Новый ОписаниеОповещения("УдалитьУведомлениеЗавершение", ЭтотОбъект, Элементы.УведомленияОбУчастии), НСтр("ru = 'Пометить на удаление Уведомление?'"), РежимДиалогаВопрос.ДаНет);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьУведомлениеЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		УдалитьУведомлениеНаСервере(ДополнительныеПараметры.ТекущиеДанные.Документ);
		Элементы.УведомленияОбУчастии.Обновить();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УдалитьУведомлениеНаСервере(Уведомление)
	ОбъектДокумент = Уведомление.ПолучитьОбъект();
	ОбъектДокумент.УстановитьПометкуУдаления(Истина);
	ОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РеестрОсновнойВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элементы.РеестрОсновной.ТекущиеДанные <> Неопределено Тогда
		ПоказатьЗначение(,Элементы.РеестрОсновной.ТекущиеДанные.Инвестор);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СценарийНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("ОбщаяФорма.ФормаКорпоративныеНалогиНастройка");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОткрытьУведомлениеОбУчастии(Команда)
	Если Элементы.УведомленияОбУчастии.ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Отсутствуют данные об иностранных инвестициях'"));
	ИначеЕсли ТипЗнч(Элементы.УведомленияОбУчастии.ТекущиеДанные.Документ) = Тип("Строка") Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Организация", Элементы.РеестрОсновной.ТекущиеДанные.Инвестор);
		ПараметрыФормы.Вставить("ВидУведомления", ПредопределенноеЗначение("Перечисление.ВидыУведомленийОСпецрежимахНалогообложения.ФормаУ_ИО"));
		ПараметрыФормы.Вставить("ИмяОтчета", "РегламентированноеУведомлениеУ_ИО");
		ПараметрыФормы.Вставить("Дата", КонецДня(Элементы.УведомленияОбУчастии.ТекущиеДанные.Период));
		ПараметрыФормы.Вставить("ОснованиеУведомленияОбИО", Элементы.УведомленияОбУчастии.ТекущиеДанные.ОснованиеУведомления);
		МассивИнвестиций = Новый Массив;
		Для каждого Стр Из Элементы.УведомленияОбУчастии.ВыделенныеСтроки Цикл
			ДанныеСтроки = Элементы.УведомленияОбУчастии.ДанныеСтроки(Стр);
			Если ДанныеСтроки.ОснованиеУведомления = ПараметрыФормы.ОснованиеУведомленияОбИО И ТипЗнч(ДанныеСтроки.Документ) = Тип("Строка") Тогда 
				МассивИнвестиций.Добавить(ДанныеСтроки.ОбъектИнвестирования);
				Если ПараметрыФормы.Дата < ДанныеСтроки.Период Тогда
					ПараметрыФормы.Дата = КонецДня(ДанныеСтроки.Период);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		ПараметрыФормы.Вставить("Инвестиции", МассивИнвестиций);
		ОткрытьФорму("Документ.УведомлениеОСпецрежимахНалогообложения.Форма.ФормаДокументаУХ", ПараметрыФормы, ЭтаФорма);
	Иначе
		ПоказатьЗначение(Неопределено, Элементы.УведомленияОбУчастии.ТекущиеДанные.Документ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УведомленияОбУчастииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если ТипЗнч(Элементы.УведомленияОбУчастии.ТекущиеДанные.Документ) = Тип("Строка") Тогда
	Иначе
		ПоказатьЗначение(Неопределено, Элементы.УведомленияОбУчастии.ТекущиеДанные.Документ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОткрытьУведомлениеОКИК(Команда)
	Если Элементы.УведомленияОКИК.ТекущиеДанные = Неопределено Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Отсутствуют данные об иностранных инвестициях'"));
	ИначеЕсли УведомленияОКИКДляИнвестора.Количество() = 0 Тогда
		ПараметрыФормы = Новый Структура();
		ПараметрыФормы.Вставить("Организация", Элементы.РеестрОсновной.ТекущиеДанные.Инвестор);
		ПараметрыФормы.Вставить("ВидУведомления", ПредопределенноеЗначение("Перечисление.ВидыУведомленийОСпецрежимахНалогообложения.ФормаКИК"));
		ПараметрыФормы.Вставить("ИмяОтчета", "РегламентированноеУведомлениеКИК");
		ПараметрыФормы.Вставить("Дата", Дата(Год, 12, 31, 23, 59, 59));
		ПараметрыФормы.Вставить("Инвестиция", Элементы.УведомленияОКИК.ТекущиеДанные.ОбъектИнвестирования);
		ПараметрыФормы.Вставить("ЭффективнаяДоля", Элементы.УведомленияОКИК.ТекущиеДанные.ЭффективнаяДоля);
		ПараметрыФормы.Вставить("НалоговыйПериод", Формат(Год, "ЧГ="));
		ЗаполнитьПодписанта(ПараметрыФормы);
		Если Год < 2023 Тогда
			ОткрытьФорму("Отчет.РегламентированноеУведомлениеКИК.Форма.Форма2021_1", ПараметрыФормы, ЭтаФорма, Истина);
		Иначе
			ОткрытьФорму("Отчет.РегламентированноеУведомлениеКИК.Форма.Форма2023_1", ПараметрыФормы, ЭтаФорма, Истина);
		КонецЕсли;
	Иначе
		ПоказатьЗначение(Неопределено, УведомленияОКИКДляИнвестора.Получить(0).Значение);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьУдостоверениеЛичностиФизЛица(ФизЛицо, ДатаСреза) 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДокументыФизическихЛиц.Представление КАК Представление,
		|	ДокументыФизическихЛиц.ВидДокумента.КодМВД КАК КодВидДок,
		|	"""" + ДокументыФизическихЛиц.Серия + "" "" + ДокументыФизическихЛиц.Номер КАК СерНомДок,
		|	ДокументыФизическихЛиц.ДатаВыдачи КАК ДатаДокДата,
		|	ДокументыФизическихЛиц.КемВыдан КАК ВыдДок
		|ИЗ
		|	РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			МАКСИМУМ(ДокументыФизическихЛиц.Период) КАК Период,
		|			ДокументыФизическихЛиц.Физлицо КАК Физлицо
		|		ИЗ
		|			РегистрСведений.ДокументыФизическихЛиц КАК ДокументыФизическихЛиц
		|		ГДЕ
		|			ДокументыФизическихЛиц.ЯвляетсяДокументомУдостоверяющимЛичность
		|			И ДокументыФизическихЛиц.Физлицо = &Физлицо
		|			И ДокументыФизическихЛиц.Период <= &ДатаСреза
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ДокументыФизическихЛиц.Физлицо) КАК ДокументыСрез
		|		ПО ДокументыФизическихЛиц.Период = ДокументыСрез.Период
		|			И ДокументыФизическихЛиц.Физлицо = ДокументыСрез.Физлицо
		|			И (ДокументыФизическихЛиц.ЯвляетсяДокументомУдостоверяющимЛичность)";
	
	Запрос.УстановитьПараметр("ДатаСреза", ДатаСреза);
	Запрос.УстановитьПараметр("Физлицо", Физлицо);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Возврат ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса.Выгрузить()[0]);
	КонецЕсли;

КонецФункции

&НаСервереБезКонтекста
Процедура ЗаполнитьПодписанта(Параметры)
	
	ОтветственныеЛица = ОтветственныеЛицаБП.ОтветственныеЛица(Параметры.Организация, Параметры.Дата);
	Параметры.Вставить("ПодписантФамилия", ОтветственныеЛица.РуководительФИО.Фамилия);
	Параметры.Вставить("ПодписантИмя", ОтветственныеЛица.РуководительФИО.Имя);
	Параметры.Вставить("ПодписантОтчество", ОтветственныеЛица.РуководительФИО.Отчество);
	
	Удостоверение = ПолучитьУдостоверениеЛичностиФизЛица(ОтветственныеЛица.Руководитель, Параметры.Дата);
	
	Если Удостоверение <> Неопределено Тогда
		Параметры.Вставить("ПодписантДокумент", Удостоверение.Представление);
	Иначе
		Параметры.Вставить("ПодписантДокумент", "");
	КонецЕсли;
	Параметры.Вставить("ПодписантТелефон", УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(ОтветственныеЛица.Руководитель, Справочники.ВидыКонтактнойИнформации.ТелефонРабочийФизическиеЛица, , Истина));
	
КонецПроцедуры

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	Если Элементы.РеестрОсновной.ТекущиеДанные = Неопределено Тогда
		УстановкаОтборов(Неопределено);
	Иначе
		УстановкаОтборов(Элементы.РеестрОсновной.ТекущиеДанные.Инвестор);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УведомленияОКИКВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//Если ТипЗнч(Элементы.УведомленияОКИК.ТекущиеДанные.Документ) = Тип("Строка") Тогда
	//Иначе
	//	ПоказатьЗначение(Неопределено, Элементы.УведомленияОКИК.ТекущиеДанные.Документ);
	//КонецЕсли;
КонецПроцедуры

#КонецОбласти
